# WEEK 3 IP

## Importing Libraries

In [1]:
# Imports

import pandas as pd
import numpy as np

## Dataset Loading

In [2]:
# Creating CDR DataFrame
cdr = pd.read_excel('CDR_description.xlsx')
cdr.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [119]:
# Creating cells geo description DataFrame
cells_desc = pd.read_excel('cells_geo_description.xlsx')
cells_desc

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [439]:
# Creating cells geo DataFrame
cells_geo = pd.read_csv('cells_geo.csv',sep =";", index_col= 0) #index_col = 0 to remove unnamed column
cells_geo.head()

,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,fbb2e75af3,0bb492ef17
1,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,1502501d78,0bb492ef17
2,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,0c2e182a0c,0bb492ef17
3,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,69bdfc69fd,8a1e6ce31f
4,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,7a1029d2ab,8a1e6ce31f

In [28]:
# Creating Telcom 1 DataFrame
telcom1 = pd.read_csv('Telcom_dataset.csv')
telcom1.head()

,PRODUTC,VALUE,DATETIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,0,2012-05-06 23:04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,2012-05-06 23:05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,2012-05-06 23:05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [22]:
# Creating Telcom 2 DataFrame
telcom2 = pd.read_csv('Telcom_dataset2.csv')
telcom2.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER,DW_B_NUMBER,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,sms,0,2012-05-07 23:02:06.0,2,32255675c3b6fe3,1aa7ae01386e9fb,19e2e,19e2e,+854AcBQT2,+854AcBQT2
1,Voice,0,2012-05-07 23:03:44.0,1,ff16d6ac74c1c64,87d87309c15a8c9,19e2e,19e2e,+854AcBQT2,+854AcBQT2
2,sms,0,2012-05-07 23:04:06.0,0,98d9f2fb5ff624b,93343ba6e41af95,19e2e,19e2e,+laSrk7g6q,+laSrk7g6q
3,Voice,37,2012-05-07 23:04:48.0,1,3f9c8a33ec7be1f,7d05a38f89c49d8,19e2e,19e2e,/xvRrCVKoQ,/xvRrCVKoQ
4,sms,25,2012-05-07 23:04:58.0,1,7bcccc03adf3864,56a5d5430d2fa86,19e2e,19e2e,+bO+qkSonO,+bO+qkSonO

In [7]:
# Creating Telcom 1 DataFrame
telcom3 = pd.read_csv('Telcom_dataset3.csv')
telcom3.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELLID,SIET_ID
0,Voice,61,2012-05-08 23:01:28.0,2,966f68353622feb,ffd53a3bb2db6f1,19e2e,19e2e,+38u2u/rfx,+38u2u/rfx
1,sms,0,2012-05-08 23:01:31.0,1,a0a597384c612d7,cf3b218f1dde792,19e2e,19e2e,+Fs4mTvdKx,+Fs4mTvdKx
2,Voice,10,2012-05-08 23:02:59.0,1,5441a9a58c97132,52f8b299515b9b7,19e2e,19e2e,+ZaaZozy/+,+ZaaZozy/+
3,sms,0,2012-05-08 23:03:04.0,0,8ab8b9ed6989f61,e09e736e46c5c3d,19e2e,19e2e,+cNeJzsTp3,+cNeJzsTp3
4,Voice,22,2012-05-08 23:03:16.0,4,52662a62b199334,2186273faab4602,19e2e,19e2e,/eeMklgyJA,/eeMklgyJA

## Data Exploration and Cleaning

### Telcom1

In [29]:
# Telcom 1 
telcom1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUTC          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATETIME         5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELL_ID          5001 non-null   object
 9   SITE_ID          4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [30]:
# Dropping nan values
telcom1.dropna(inplace=True)

In [35]:
# Checking for, and removing duplicates.
telcom1.duplicated().any().any() # True
telcom1.drop_duplicates(inplace=True)

In [36]:
# Check changes
telcom1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4215 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUTC          4215 non-null   object
 1   VALUE            4215 non-null   int64
 2   DATETIME         4215 non-null   object
 3   CELL_ON_SITE     4215 non-null   object
 4   DW_A_NUMBER_INT  4215 non-null   object
 5   DW_B_NUMBER_INT  4215 non-null   object
 6   COUNTRY_A        4215 non-null   object
 7   COUNTRY_B        4215 non-null   object
 8   CELL_ID          4215 non-null   object
 9   SITE_ID          4215 non-null   object
dtypes: int64(1), object(9)
memory usage: 362.2+ KB

In [56]:
# Change column name as per excel sheet specifications.
telcom1.rename(columns = {'PRODUTC':'PRODUCT', 'DATETIME': 'DATE_TIME'}, inplace  = True)
# Check changes
telcom1.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [80]:
# Change column values as per excel sheet specifications.

telcom1['PRODUCT'].replace("sms", "SMS", inplace=True)
telcom1['PRODUCT'].unique()

array(['Voice', 'SMS'], dtype=object)

In [69]:
# Change data types as per excel sheet specifications.

# Check for unwanted values.
telcom1['CELL_ON_SITE'].unique()
# Check number 
len(telcom1[telcom1['CELL_ON_SITE']== '_']) # = 92
# Drop invalid entries
telcom1 = telcom1[telcom1['CELL_ON_SITE'] != '_']
telcom1['CELL_ON_SITE'].unique()
# Change to integer dtype
telcom1['CELL_ON_SITE'] = telcom1['CELL_ON_SITE'].astype('int64')
telcom1['CELL_ON_SITE'].dtype

C:\Users\HP\anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

dtype('int64')

### Telcom2

In [31]:
# Telcom 2
telcom2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATE_TIME     5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A_NUMBER   5001 non-null   object
 5   DW_B_NUMBER   5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [32]:
# Dropping nan values
telcom2.dropna(inplace=True)

In [39]:
# Checking for, and removing duplicates.
telcom2.duplicated().any().any() # True
telcom2.drop_duplicates(inplace=True)

In [507]:
telcom2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4173 entries, 0 to 4998
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          4173 non-null   object
 1   VALUE            4173 non-null   int64
 2   DATE_TIME        4173 non-null   object
 3   CELL_ON_SITE     4173 non-null   int64
 4   DW_A_NUMBER_INT  4173 non-null   object
 5   DW_B_NUMBER_INT  4173 non-null   object
 6   COUNTRY_A        4173 non-null   object
 7   COUNTRY_B        4173 non-null   object
 8   CELL_ID          4173 non-null   object
 9   SITE_ID          4173 non-null   object
dtypes: int64(2), object(8)
memory usage: 358.6+ KB

In [57]:
# Change column names
telcom2.rename(columns = {'DW_A_NUMBER':'DW_A_NUMBER_INT', 'DW_B_NUMBER': 'DW_B_NUMBER_INT'}, inplace  = True)
# Check changes.
telcom2.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [81]:
# Change column values as per excel sheet specifications.

telcom2['PRODUCT'].replace("sms", "SMS", inplace=True)
telcom2['PRODUCT'].unique()

array(['SMS', 'Voice'], dtype=object)

In [73]:
# Change data types as per excel sheet specifications.

# Check for unwanted values.
telcom2['CELL_ON_SITE'].unique()
# Check number 
len(telcom2[telcom2['CELL_ON_SITE']== '_']) # 90
# Drop invalid entries
telcom2 = telcom2[telcom2['CELL_ON_SITE'] != '_']
telcom2['CELL_ON_SITE'].unique()
# Change to integer dtype
telcom2['CELL_ON_SITE'] = telcom2['CELL_ON_SITE'].astype('int64')
telcom2['CELL_ON_SITE'].dtype

dtype('int64')

### Telcom3

In [40]:
# Telcom 3
telcom3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELLID           5001 non-null   object
 9   SIET_ID          4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [41]:
# Dropping nan values
telcom3.dropna(inplace=True)

In [44]:
# Checking for, and removing duplicates.
telcom3.duplicated().any().any() # Trueb
telcom3.drop_duplicates(inplace=True)

In [505]:
telcom3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4222 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          4222 non-null   object
 1   VALUE            4222 non-null   int64
 2   DATE_TIME        4222 non-null   object
 3   CELL_ON_SITE     4222 non-null   int64
 4   DW_A_NUMBER_INT  4222 non-null   object
 5   DW_B_NUMBER_INT  4222 non-null   object
 6   COUNTRY_A        4222 non-null   object
 7   COUNTRY_B        4222 non-null   object
 8   CELL_ID          4222 non-null   object
 9   SITE_ID          4222 non-null   object
dtypes: int64(2), object(8)
memory usage: 362.8+ KB

In [96]:
# Change column names
telcom3.rename(columns = {'CELLID':'CELL_ID', 'SIET_ID': 'SITE_ID'}, inplace  = True)
# Check changes.
telcom3.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [82]:
# Change column values as per excel sheet specifications.

telcom3['PRODUCT'].replace("sms", "SMS", inplace=True)
telcom3['PRODUCT'].unique()

array(['Voice', 'SMS'], dtype=object)

In [78]:
# Change data types as per excel sheet specifications.

# Check for unwanted values.
telcom3['CELL_ON_SITE'].unique()
# Check number 
len(telcom3[telcom3['CELL_ON_SITE']== '_']) # 89
# Drop invalid entries
telcom3 = telcom3[telcom3['CELL_ON_SITE'] != '_']
telcom3['CELL_ON_SITE'].unique()
# Change to integer dtype
telcom3['CELL_ON_SITE'] = telcom3['CELL_ON_SITE'].astype('int64')
telcom3['CELL_ON_SITE'].dtype

dtype('int64')

### Merging

In [438]:
# Merging datasets

telcom_all = pd.concat([telcom1, telcom2, telcom3], axis = 0, ignore_index=True)
# Drop useless columns
telcom_all.drop(columns=['COUNTRY_A','COUNTRY_B','CELL_ON_SITE'], axis = 1, inplace = True)
# Preview
telcom_all.head()

,PRODUCT,VALUE,DATE_TIME,DW_A_NUMBER_INT,DW_B_NUMBER_INT,CELL_ID,SITE_ID
0,Voice,0,2012-05-06 23:04:37.0,49fae048b547780,1a49f8b0ded9de6,/TJNe+Mmtu,/TJNe+Mmtu
1,SMS,0,2012-05-06 23:05:25.0,7a54a6eaee19e65,93343ba6e41af95,/+cKZKIp41,/+cKZKIp41
2,SMS,25,2012-05-06 23:05:41.0,6008887b0207d82,7aacc9709ce0a20,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,7370032e20f4e96,6af4a60e74c91d3,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,966ba4656e38e62,02aa736ee555d5c,051KhYDCpv,051KhYDCpv

In [98]:
# Check information
telcom_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12518 entries, 0 to 12517
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          12518 non-null  object
 1   VALUE            12518 non-null  int64
 2   DATE_TIME        12518 non-null  object
 3   CELL_ON_SITE     12518 non-null  int64
 4   DW_A_NUMBER_INT  12518 non-null  object
 5   DW_B_NUMBER_INT  12518 non-null  object
 6   COUNTRY_A        12518 non-null  object
 7   COUNTRY_B        12518 non-null  object
 8   CELL_ID          12518 non-null  object
 9   SITE_ID          12518 non-null  object
dtypes: int64(2), object(8)
memory usage: 978.1+ KB

### cells_geo

In [115]:
# Check information
cells_geo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3974 entries, 0 to 3973
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        3974 non-null   object
 1   STATUS        3907 non-null   object
 2   LOCALISATION  3974 non-null   object
 3   DECOUPZONE    3974 non-null   object
 4   ZONENAME      3968 non-null   object
 5   LONGITUDE     3974 non-null   float64
 6   LATITUDE      3974 non-null   float64
 7   REGION        3974 non-null   object
 8   AREA          3951 non-null   object
 9   CELL_ID       3974 non-null   object
 10  SITE_CODE     3974 non-null   object
dtypes: float64(2), object(9)
memory usage: 372.6+ KB

In [445]:

# Filling nan values
cells_geo['STATUS'].fillna('Not in service', inplace = True)
# Check changes
cells_geo['STATUS'].unique()
# Dropping nan values
cells_geo.dropna(inplace=True)

In [446]:
# Checking for, and removing duplicates.
cells_geo.duplicated().any().any() # True
cells_geo.drop_duplicates(inplace=True)

In [447]:
# Check changes
cells_geo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3902 entries, 23 to 3973
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        3902 non-null   object
 1   STATUS        3902 non-null   object
 2   LOCALISATION  3902 non-null   object
 3   DECOUPZONE    3902 non-null   object
 4   ZONENAME      3902 non-null   object
 5   LONGITUDE     3902 non-null   float64
 6   LATITUDE      3902 non-null   float64
 7   REGION        3902 non-null   object
 8   AREA          3902 non-null   object
 9   CELL_ID       3902 non-null   object
 10  SITE_CODE     3902 non-null   object
dtypes: float64(2), object(9)
memory usage: 365.8+ KB

In [502]:
cells_geo.corr() # Very small correlation between the two.

           LONGITUDE  LATITUDE
LONGITUDE   1.000000 -0.458196
LATITUDE   -0.458196  1.000000

## Analysis

In [102]:
# Check description
telcom_all.describe()

              VALUE  CELL_ON_SITE
count  12518.000000  12518.000000
mean      27.655616      1.495047
std      111.787407      1.361578
min        0.000000      0.000000
25%        0.000000      0.000000
50%        0.000000      1.000000
75%       25.000000      2.000000
max     6750.000000      8.000000

### By City

#### 1. Most used cities

##### Analysis

In [448]:
# Check available columns
cells_geo.columns

Index(['VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE', 'ZONENAME',
       'LONGITUDE', 'LATITUDE', 'REGION', 'AREA', 'CELL_ID', 'SITE_CODE'],
      dtype='object')

In [449]:
# Check service status available
cells_geo['STATUS'].unique()

array(['In Service', 'Not in service'], dtype=object)

##### Result

In [452]:
# Since the status is uniform for all records, 
# Top 10 most used cities 
cells_geo[cells_geo['STATUS'] == 'In Service']['VILLES'].value_counts().head(10)

COCODY          353
YOPOUGON        286
ABOBO           244
MARCORY         140
TREICHVILLE     132
YAMOUSSOUKRO    104
ADJAME          102
PLATEAU         100
KOUMASSI         91
BOUAKE           65
Name: VILLES, dtype: int64

In [509]:
# Least Used Cities
cells_geo['VILLES'].value_counts().tail(10)

KETRO BASSAM    3
SOROBANGO       3
MONTCOUPE       3
AKOUYAKRO       3
ZAROKO          3
KOTOULA         2
MEMNI           2
KRIKOREA        2
DANANON         1
OUANGOLO        1
Name: VILLES, dtype: int64

In [518]:
cells_geo['LOCALISATION'].unique()

array(['ABIDJAN', 'INTERIEUR'], dtype=object)

In [517]:

cells_geo['LOCALISATION'].value_counts()

INTERIEUR    2276
ABIDJAN      1626
Name: LOCALISATION, dtype: int64

In [515]:
cells_geo[(cells_geo['STATUS'] == 'In Service') & ((cells_geo)['LOCALISATION'] == 'ABIDJAN')]['VILLES'].value_counts().head(10)

COCODY         353
YOPOUGON       286
ABOBO          244
MARCORY        140
TREICHVILLE    132
ADJAME         102
PLATEAU        100
KOUMASSI        91
PORT-BOUET      55
ATTECOUBE       45
Name: VILLES, dtype: int64

In [516]:
cells_geo[(cells_geo['STATUS'] == 'In Service') & ((cells_geo)['LOCALISATION'] != 'ABIDJAN')]['VILLES'].value_counts().head(10)

YAMOUSSOUKRO    104
BOUAKE           65
DALOA            59
GAGNOA           55
SAN-PEDRO        55
DIVO             36
KORHOGO          31
SOUBRE           28
GUIGLO           27
GRAND-BASSAM     25
Name: VILLES, dtype: int64

### 2. Most used city during business and home hours

##### Analysis

In [453]:
# Check columns
print(telcom_all.columns)
print(cells_geo.columns)

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT',
       'CELL_ID', 'SITE_ID'],
      dtype='object')
Index(['VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE', 'ZONENAME',
       'LONGITUDE', 'LATITUDE', 'REGION', 'AREA', 'CELL_ID', 'SITE_CODE'],
      dtype='object')

In [459]:
# Comparing CELL_IDs in both datasets
ids = []
for id in list(cells_geo[cells_geo['STATUS'] == 'In Service']['CELL_ID'].unique()):
    if id not in list(telcom_all['CELL_ID'].unique()):
        continue
    else:
       ids.append(id) 
print(len(ids)) # No similar CELL IDs

0

In [460]:
# Comparing CELL_IDs in both datasets
ids2 = []
for id in list(telcom_all['SITE_ID'].unique()):
    if id not in list(cells_geo[cells_geo['STATUS'] == 'In Service']['SITE_CODE'].unique()):
        continue
    else:
       ids.append(id) 
print(len(ids)) # No similar CELL IDs

862

In [461]:
# Merging tables on site id and site code.

tel_cells = cells_geo.merge(telcom_all[['SITE_ID','DATE_TIME']], left_on = 'SITE_CODE', right_on = 'SITE_ID')
tel_cells.head()
tel_cells.isna().any().any() #True
tel_cells.dropna(inplace = True)
tel_cells.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49428 entries, 0 to 49427
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        49428 non-null  object
 1   STATUS        49428 non-null  object
 2   LOCALISATION  49428 non-null  object
 3   DECOUPZONE    49428 non-null  object
 4   ZONENAME      49428 non-null  object
 5   LONGITUDE     49428 non-null  float64
 6   LATITUDE      49428 non-null  float64
 7   REGION        49428 non-null  object
 8   AREA          49428 non-null  object
 9   CELL_ID       49428 non-null  object
 10  SITE_CODE     49428 non-null  object
 11  SITE_ID       49428 non-null  object
 12  DATE_TIME     49428 non-null  object
dtypes: float64(2), object(11)
memory usage: 5.3+ MB

##### Result

In [508]:
# Splitting the date column
tel_cells['HOUR'] = tel_cells['DATE_TIME'].apply(lambda x: int(x[-10:-8]))
tel_cells['MIN'] = tel_cells['DATE_TIME'].apply(lambda x: int(x[-7:-5]))
tel_cells['SEC'] = tel_cells['DATE_TIME'].apply(lambda x: int(x[-4:-2]))
# Grouping by the VILLES and DATE_TIME columns
total_time = tel_cells[['VILLES', 'DATE_TIME','HOUR','MIN','SEC']].groupby(['VILLES', 'DATE_TIME']).sum()
# Obtaining the total sum for the sec, min and hours
total_time = total_time.groupby('VILLES').sum()
# Time in hours
total_time['Total_Time'] = ((total_time['HOUR']/3600) + (total_time['MIN']/60) + total_time['SEC'])/3600
# Sorting according to the higest total time to obtain the most used city during business and working hours.
total_time.sort_values('Total_Time',ascending=False)[['Total_Time']].head(10)

              Total_Time
VILLES
YOPOUGON       63.448463
ABOBO          43.671241
COCODY         27.570685
ADJAME         18.766690
KOUMASSI       15.743296
MARCORY        15.477745
YAMOUSSOUKRO   15.393375
TREICHVILLE    15.339278
DALOA          12.907444
ATTECOUBE      11.903097

In [510]:
# Least used
total_time.sort_values('Total_Time',ascending=False)[['Total_Time']].tail(10)

                 Total_Time
VILLES
SANANFEREDOUGOU    0.005000
TOUVRE             0.004167
BACANDA            0.004167
TORO-KINKENE       0.004167
ATTIGUEHI          0.003347
NGATTADOLIKRO      0.003347
BINAO              0.003333
SAMO               0.002500
ANIANSUE           0.001681
PONANGUIGLO        0.000000

#### 3. Most Used City

##### Result

In [465]:
# Most Used City
cells_geo['VILLES'].value_counts().head(1)

COCODY    353
Name: VILLES, dtype: int64

### By Product

#### 4. Most Popular Product

In [415]:
# Popular product
telcom_all['PRODUCT'].value_counts()

SMS      6950
Voice    5568
Name: PRODUCT, dtype: int64

SMS is the most popular product.

In [416]:
# Higher billing
telcom_all[['PRODUCT','VALUE']].groupby(telcom_all['PRODUCT']).sum().sort_values('VALUE', ascending=False)

          VALUE
PRODUCT
Voice    293816
SMS       52377

Voice has the highest billing price.

In [420]:
# Site with the most subscribers
# Phone numbers of local people.
locals_num = list(telcom_all['DW_A_NUMBER_INT'].unique())
len(locals_num) # 9198 subscribers

9198

In [436]:
# Check columns
cells_geo.columns

Index(['VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE', 'ZONENAME',
       'LONGITUDE', 'LATITUDE', 'REGION', 'AREA', 'CELL_ID', 'SITE_CODE'],
      dtype='object')

In [495]:
# Most active zones
pop_site_id = telcom_all[['SITE_ID', 'DW_A_NUMBER_INT']][telcom_all['DW_A_NUMBER_INT'].map(lambda x : x in locals_num)]
# List of site IDs
ids = list(pop_site_id['SITE_ID'])
# Data Frame of sites with the most subscribers
sites = list(cells_geo[cells_geo['SITE_CODE'].map(lambda x: x in ids)]['SITE_CODE'])
cells_geo[cells_geo['SITE_CODE'].map(lambda x: x in ids)].groupby(cells_geo['ZONENAME']).count()[['VILLES']].sort_values('VILLES', ascending = False).head(10)

                         VILLES
ZONENAME
ZONE A - Grand-NORD         441
ZONE B - Grand-SUD          408
ZONE D - Grand-OUEST        405
ZONE B - Abidjan_EST        368
ZONE C - Abidjan_OUEST      341
ZONE A - Abidjan_CENTRE     310
ZONE C - Grand-EST          308
ZONE E - Abidjan_NORD       289
ZONE E - SUD-OUEST          285
ZONE D - Abidjan_SUD        191

ZONE A - Grand-NORD has the highest number of active subscribers.